; domain
(define (domain pacman)

    (:requirements :strips :disjunctive-preconditions :typing :conditional-effects :negative-preconditions)

    (:types
        posicao
    )

    (:predicates
        ; Predicados de Localização
        (pacman-em ?px ?py - posicao)
        (fantasmaG-em ?px ?py - posicao)
        (frutaG-em ?px ?py - posicao)
        (parede-em ?px ?py - posicao)

        ; Predicados de liberação
        (pacman-liberado)
        (fantasmaG-liberado)

        ; Predicados de Direção do Fantasma Verde:
        (fantasmaG-up)
        (fantasmaG-right)
        (fantasmaG-down)
        (fantasmaG-left)

        ; Predicados de Checagem de Morte:
        (checar-morto-pre)
        (checar-morto-pos)

        ; Predicados de Incremento/Decremento:
        (inc ?x ?xn)
        (dec ?x ?xn)

        ; Predicados frutas:
        (frutaG-ativa)

        ; Predicados de finalização
        (fantasmaG-morto)
        (pacman-morto)
    )

    ;------------------------------------------Checagem------------------------------------------
    (:action checagem-morto-pre
        :parameters (?px ?py - posicao)
        :precondition (and (checar-morto-pre) (pacman-em ?px ?py))
        :effect (and
            (when
                (and (pacman-em ?px ?py) (fantasmaG-em ?px ?py))
                (pacman-morto)
            )
            (not(checar-morto-pre))
            (fantasmaG-liberado)
            (when
                (and (pacman-em ?px ?py)(frutaG-em ?px ?py))
                (and(frutaG-ativa) (not(frutaG-em ?px ?py))))
        )
    )
    (:action checagem-morto-pos
        :parameters (?px ?py - posicao)
        :precondition (and (checar-morto-pos) (pacman-em ?px ?py))
        :effect (and
            (when
                (and (pacman-em ?px ?py) (fantasmaG-em ?px ?py))
                (pacman-morto)
            )
            (not(checar-morto-pos))
            (pacman-liberado)
        )
    )
    ;---------------------------------------Pacman----------------------------------------
    (:action move-pacman-up
        :parameters (?x ?y ?yn - posicao)
        :precondition (and (pacman-liberado) (pacman-em ?x ?y) (dec ?y ?yn))
        :effect (and
            (when
                (and
                    (not(parede-em ?x ?yn))
                )
                (and
                    (not (pacman-em ?x ?y))
                    (not(pacman-liberado))
                    (pacman-em ?x ?yn)
                    (fantasmaG-up)
                    (checar-morto-pre)
                )
            )
        )
    )

    (:action move-pacman-down
        :parameters (?x ?y ?yn - posicao)
        :precondition (and (pacman-liberado) (pacman-em ?x ?y) (inc ?y ?yn))
        :effect (and
            (when
                (and
                    (not(parede-em ?x ?yn))
                )

                (and
                    (not (pacman-em ?x ?y))
                    (not(pacman-liberado))

                    (pacman-em ?x ?yn)
                    (fantasmaG-down)
                    (checar-morto-pre)
                )
            )
        )
    )

    (:action move-pacman-left
        :parameters (?x ?y ?xn - posicao)
        :precondition (and (pacman-liberado) (pacman-em ?x ?y) (dec ?x ?xn))
        :effect (and
            (when
                (and
                    (not(parede-em ?xn ?y))
                )

                (and
                    (not(pacman-em ?x ?y))
                    (not(pacman-liberado))

                    (pacman-em ?xn ?y)
                    (fantasmaG-left)
                    (checar-morto-pre)
                )
            )
        )
    )

    (:action move-pacman-right
        :parameters (?x ?y ?xn - posicao)
        :precondition (and (pacman-liberado) (pacman-em ?x ?y) (inc ?x ?xn))
        :effect (and
            (when
                (and
                    (not(parede-em ?xn ?y))
                )

                (and
                    (not(pacman-em ?x ?y))
                    (not(pacman-liberado))

                    (pacman-em ?xn ?y)
                    (fantasmaG-right)
                    (checar-morto-pre)
                )
            )
        )
    )

    ; ---------------------------------------GREEN----------------------------------------

    (:action move-fantasmaG-up
        :parameters (?x ?y ?yn - posicao)
        :precondition (and (fantasmaG-em ?x ?y) (fantasmaG-liberado) (not(fantasmaG-morto)) (fantasmaG-up) (dec ?y ?yn))
        :effect (and
            (when
                (and
                    (not(parede-em ?x ?yn))
                )
                (and
                    (not(fantasmaG-em ?x ?y))
                    (fantasmaG-em ?x ?yn)
                    (not(fantasmaG-up))
                    (not(fantasmaG-liberado))
                    (checar-morto-pos)

                )
            )
            (when
                (and (parede-em ?x ?yn))
                (and (not(fantasmaG-liberado)) (not(fantasmaG-up)) (checar-morto-pos))
            )
        )
    )

    (:action move-fantasmaG-down
        :parameters (?x ?y ?yn - posicao)
        :precondition (and (fantasmaG-em ?x ?y) (fantasmaG-liberado) (not(fantasmaG-morto)) (fantasmaG-down) (inc ?y ?yn))
        :effect (and
            (when
                (and
                    (not(parede-em ?x ?yn))
                )
                (and
                    (not(fantasmaG-em ?x ?y))
                    (fantasmaG-em ?x ?yn)
                    (not(fantasmaG-down))
                    (not(fantasmaG-liberado))
                    (checar-morto-pos)

                )
            )
            (when
                (and (parede-em ?x ?yn))
                (and (not(fantasmaG-liberado)) (not(fantasmaG-down)) (checar-morto-pos))
            )
        )
    )

    (:action move-fantasmaG-left
        :parameters (?x ?y ?xn - posicao)
        :precondition (and (fantasmaG-em ?x ?y) (fantasmaG-liberado) (not(fantasmaG-morto)) (fantasmaG-left) (dec ?x ?xn))
        :effect (and
            (when
                (and
                    (not(parede-em ?xn ?y))
                )
                (and
                    (not(fantasmaG-em ?x ?y))
                    (fantasmaG-em ?xn ?y)
                    (not(fantasmaG-left))
                    (not(fantasmaG-liberado))
                    (checar-morto-pos)

                )
            )

            (when
                (and (parede-em ?xn ?y))
                (and (not(fantasmaG-liberado)) (not(fantasmaG-left)) (checar-morto-pos))
            )
        )
    )

    (:action move-fantasmaG-right
        :parameters (?x ?y ?xn - posicao)
        :precondition (and (fantasmaG-em ?x ?y) (fantasmaG-liberado) (not(fantasmaG-morto)) (fantasmaG-right) (inc ?x ?xn))
        :effect (and
            (when
                (and
                    (not(parede-em ?xn ?y))
                )
                (and
                    (not(fantasmaG-em ?x ?y))
                    (fantasmaG-em ?xn ?y)
                    (not(fantasmaG-right))
                    (not(fantasmaG-liberado))
                    (checar-morto-pos)

                )
            )

            (when
                (and (parede-em ?xn ?y))
                (and (not(fantasmaG-liberado)) (not(fantasmaG-right)) (checar-morto-pos))
            )
        )
    )
    ;---------------------------------------ComerFrutaGreen-------------------------------------

    (:action comer-fantasma-Green
        :parameters (?px ?py - posicao)
        :precondition (and (pacman-em ?px ?py) (fantasmaG-em ?px ?py) (frutaG-ativa))
        :effect (and (fantasmaG-morto) (not(frutaG-ativa)))
    )

)

; problem
(define (problem pacman3x3)
    (:domain pacman)
    (:objects
        x1 x2 x3 x4 x5 y1 y2 y3 y4 y5 - posicao
    )
    (:init
        (pacman-liberado)
        (pacman-em x2 y2)
        (fantasmaG-em x4 y4)
        (frutaG-em x3 y3)

        (parede-em x1 y1)
        (parede-em x1 y2)
        (parede-em x1 y3)
        (parede-em x1 y4)
        (parede-em x1 y5)
        (parede-em x2 y1)
        (parede-em x2 y5)
        (parede-em x3 y1)
        (parede-em x3 y5)
        (parede-em x4 y1)
        (parede-em x4 y5)
        (parede-em x5 y1)
        (parede-em x5 y2)
        (parede-em x5 y3)
        (parede-em x5 y4)
        (parede-em x5 y5)

        (inc x1 x2)
        (inc x2 x3)
        (inc x3 x4)
        (inc x4 x5)
        (inc y1 y2)
        (inc y2 y3)
        (inc y3 y4)
        (inc y4 y5)
        (dec x5 x4)
        (dec x4 x3)
        (dec x3 x2)
        (dec x2 x1)
        (dec y5 y4)
        (dec y4 y3)
        (dec y3 y2)
        (dec y2 y1)

    )
    (:goal
        (and
            (not(pacman-morto))
            (fantasmaG-morto)
        )
    )
)

; plan
1. (move-pacman-right x2 y2 x3)
   deleted: (pacman-em x2 y2) (pacman-liberado)
   added: (pacman-em x3 y2) (fantasmag-right) (checar-morto-pre)
   goals met: 1 of 2
2. (checagem-morto-pre x3 y2)
   deleted: (checar-morto-pre)
   added: (fantasmag-liberado)
   goals met: 1 of 2
3. (move-fantasmag-right x4 y4 x5)
   deleted: (fantasmag-liberado) (fantasmag-right)
   added: (checar-morto-pos)
   goals met: 1 of 2
4. (checagem-morto-pos x3 y2)
   deleted: (checar-morto-pos)
   added: (pacman-liberado)
   goals met: 1 of 2
5. (move-pacman-down x3 y2 y3)
   deleted: (pacman-em x3 y2) (pacman-liberado)
   added: (pacman-em x3 y3) (fantasmag-down) (checar-morto-pre)
   goals met: 1 of 2
6. (checagem-morto-pre x3 y3)
   deleted: (checar-morto-pre) (frutag-em x3 y3)
   added: (fantasmag-liberado) (frutag-ativa)
   goals met: 1 of 2
7. (move-fantasmag-down x4 y4 y5)
   deleted: (fantasmag-liberado) (fantasmag-down)
   added: (checar-morto-pos)
   goals met: 1 of 2
8. (checagem-morto-pos x3 y3)
   deleted: (checar-morto-pos)
   added: (pacman-liberado)
   goals met: 1 of 2
9. (move-pacman-right x3 y3 x4)
   deleted: (pacman-em x3 y3) (pacman-liberado)
   added: (pacman-em x4 y3) (fantasmag-right) (checar-morto-pre)
   goals met: 1 of 2
10. (checagem-morto-pre x4 y3)
   deleted: (checar-morto-pre)
   added: (fantasmag-liberado)
   goals met: 1 of 2
11. (move-fantasmag-right x4 y4 x5)
   deleted: (fantasmag-liberado) (fantasmag-right)
   added: (checar-morto-pos)
   goals met: 1 of 2
12. (checagem-morto-pos x4 y3)
   deleted: (checar-morto-pos)
   added: (pacman-liberado)
   goals met: 1 of 2
13. (move-pacman-down x4 y3 y4)
   deleted: (pacman-em x4 y3) (pacman-liberado)
   added: (pacman-em x4 y4) (fantasmag-down) (checar-morto-pre)
   goals met: 1 of 2
14. (comer-fantasma-green x4 y4)
   deleted: (frutag-ativa)
   added: (fantasmag-morto)
   goals met: 2 of 2
